// Обчислення суми елементів масиву
const arrayA = [10, 20, 30, 40, 50, 0, -10, 66.66, -206.66]; // масив чисел

// Використання методу reduce для обчислення суми елементів масиву
// accumulator це 'кошик' (зберігає значення, яке ми отримали на попередньому кроці.)
// currentValue це поточне значення
// 0 - початкове значення для акумулятора
const reduceA = arrayA.reduce((accumulator, currentValue) => accumulator + currentValue, 0); 
console.log (reduceA)  // Виведе: 0

//приклад розрахунку суми елементів масиву:
// 10 + 20 = 30
// 30 + 30 = 60 
// 60 + 40 = 100
// 100 + 50 = 150
// 150 + 0 = 150
// 150 + (-10) = 140
// 140 + 66.66 = 206.66
// 206.66 + (-206.66) = 0